#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/424f048c-1eb8-426f-abdb-41d1435829b0/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_object.redirects[610] must be replaced
-/+ resource "aws_s3_object" "redirects" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ etag                   = "d41d8cd98f00b204e9800998ecf8427e" -> (known after apply)
      ~ id                     = "/workflows/liquibase-community/jandro.html" -> (known after apply)
      ~ key                    = "/workflows/liquibase-community/jandro.html" -> "/workflows/liquibase-community/liquibase-auto-rollback.html" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version_id             = "4nZA6njImsFTaNUdkbVavxzgn2IcClLR" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.redirects[611] will be destroyed
  # (because index [611] is out of range for count)
  - resource "aws_s3_object" "redirects" {
      - acl                    = "private" -> null
      - bucket                 = "stage-docsstageliquibasecom-origin" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "d41d8cd98f00b204e9800998ecf8427e" -> null
      - force_destroy          = false -> null
      - id                     = "/workflows/liquibase-community/liquibase-auto-rollback.html" -> null
      - key                    = "/workflows/liquibase-community/liquibase-auto-rollback.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "jbQGNZnpMn_w1jdwhYm8Am495N3YSV1s" -> null
      - website_redirect       = "/workflows/liquibase-community/automatic-custom-rollbacks.html" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_object.redirects[610] must be replaced%0A-/+ resource "aws_s3_object" "redirects" {%0A      ~ bucket_key_enabled     = false -> (known after apply)%0A      ~ etag                   = "d41d8cd98f00b204e9800998ecf8427e" -> (known after apply)%0A      ~ id                     = "/workflows/liquibase-community/jandro.html" -> (known after apply)%0A      ~ key                    = "/workflows/liquibase-community/jandro.html" -> "/workflows/liquibase-community/liquibase-auto-rollback.html" # forces replacement%0A      + kms_key_id             = (known after apply)%0A      - metadata               = {} -> null%0A      ~ server_side_encryption = "AES256" -> (known after apply)%0A      ~ storage_class          = "STANDARD" -> (known after apply)%0A      - tags                   = {} -> null%0A      ~ tags_all               = {} -> (known after apply)%0A      ~ version_id             = "4nZA6njImsFTaNUdkbVavxzgn2IcClLR" -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects[611] will be destroyed%0A  # (because index [611] is out of range for count)%0A  - resource "aws_s3_object" "redirects" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "stage-docsstageliquibasecom-origin" -> null%0A      - bucket_key_enabled     = false -> null%0A      - content_type           = "text/html" -> null%0A      - etag                   = "d41d8cd98f00b204e9800998ecf8427e" -> null%0A      - force_destroy          = false -> null%0A      - id                     = "/workflows/liquibase-community/liquibase-auto-rollback.html" -> null%0A      - key                    = "/workflows/liquibase-community/liquibase-auto-rollback.html" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {} -> null%0A      - tags_all               = {} -> null%0A      - version_id             = "jbQGNZnpMn_w1jdwhYm8Am495N3YSV1s" -> null%0A      - website_redirect       = "/workflows/liquibase-community/automatic-custom-rollbacks.html" -> null%0A    }%0A%0APlan: 1 to add, 0 to change, 2 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @jandroav, Action: `pull_request`, Working Directory: `/home/runner/work/liquibase-docs/liquibase-docs`, Workflow: `Publish Staging Redirects`*